{
  "title": "Full-Stack Software Engineer",
  "company": "Cool Beans Technologies",
  "location": "Hybrid — New York, NY",
  "description": "Company Overview:\nCool Beans Technologies is a rapidly growing startup focused on delivering innovative, cloud-native solutions for enterprise clients. Our mission is to create scalable platforms and exceptional user experiences by leveraging modern web technologies and distributed systems.\n\nAs a Full-Stack Engineer at Cool Beans, you’ll work in a highly collaborative environment, building products that power mission-critical workflows for clients across multiple industries. You’ll play a key role in architecting, developing, and optimizing performant and reliable software.\n\nResponsibilities:\n- Design, develop, and maintain full-stack web applications using React.js, Next.js, and Node.js.\n- Build, scale, and optimize RESTful and GraphQL APIs that power high-traffic frontend experiences.\n- Manage PostgreSQL databases and implement caching solutions such as Redis for performance tuning.\n- Deploy, monitor, and maintain applications in AWS environments using Docker and Kubernetes.\n- Work closely with product, design, and DevOps teams to ensure reliable, secure, and user-focused software delivery.\n- Contribute to CI/CD pipelines and ensure smooth automated deployments.\n- Participate in code reviews, write maintainable documentation, and follow best practices for testing and performance.\n\nQualifications:\n- 3–5 years of professional experience in full-stack software development.\n- Strong proficiency in JavaScript/TypeScript, React.js, and Node.js.\n- Experience with server-side rendering frameworks such as Next.js.\n- Solid understanding of relational databases, particularly PostgreSQL.\n- Familiarity with Docker and Kubernetes in cloud deployment workflows.\n- Hands-on experience with AWS services like EC2, S3, or Lambda.\n- Excellent communication skills and a passion for writing clean, maintainable code.\n\nPreferred Skills:\n- Experience building or maintaining CI/CD pipelines (GitHub Actions, Jenkins, etc.).\n- Knowledge of microservices architecture and API gateway design.\n- Familiarity with infrastructure-as-code tools like Terraform or CloudFormation.\n- Understanding of authentication and security best practices in web applications.\n- Exposure to observability tools like Prometheus, Grafana, or Datadog.\n\nWhat We Offer:\n- Competitive salary and meaningful equity options.\n- Hybrid work environment with flexible hours.\n- Generous paid time off, health coverage, and parental leave.\n- Annual professional development budget and access to top tech conferences.\n- A collaborative, engineering-driven culture that values mentorship, innovation, and continuous growth."
}
